doc/index.html
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"
lang="en" xml:lang="en">
<head>
<title>EP Simulator Help</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2010-11-28 20:10:16 EST"/>
<meta name="author" content="David Mann"/>
</head><body>
<h1 class="title">EP Simulator Help</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 Copyright and License </a></li>
<li><a href="#sec-2">2 Disclaimer </a></li>
<li><a href="#sec-3">3 Websites </a>
<ul>
<li><a href="#sec-3.1">3.1 EP Studios, Inc. </a></li>
<li><a href="#sec-3.2">3.2 Git repository </a></li>
<li><a href="#sec-3.3">3.3 Screenshots </a></li>
<li><a href="#sec-3.4">3.4 EP Studios Blog </a></li>
</ul>
</li>
<li><a href="#sec-4">4 Differences between EP Simulator and the GE/Prucka System </a>
<ul>
<li><a href="#sec-4.1">4.1 Help System </a></li>
<li><a href="#sec-4.2">4.2 Simulator Settings menu </a></li>
<li><a href="#sec-4.3">4.3 Navigator blue sidebar </a></li>
<li><a href="#sec-4.4">4.4 Patient Information dialog </a></li>
<li><a href="#sec-4.5">4.5 Administrator mode </a></li>
<li><a href="#sec-4.6">4.6 Optical disk emulation </a></li>
<li><a href="#sec-4.7">4.7 EP List edit boxes </a></li>
<li><a href="#sec-4.8">4.8 Look and feel </a></li>
<li><a href="#sec-4.9">4.9 No ADT option in Navigator </a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1">1 Copyright and License </h2>
<div id="text-1">

<p>EP Simulator is copyright 2006-2010 by EP Studios, Inc.  The
software license is GPL version 2.
</p></div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2">2 Disclaimer </h2>
<div id="text-2">

<p>EP Simulator is currently under development.  This Help file is
probably not very helpful &ndash; yet.
</p></div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3">3 Websites </h2>
<div id="text-3">


</div>

<div id="outline-container-3.1" class="outline-3">
<h3 id="sec-3.1">3.1 EP Studios, Inc. </h3>
<div id="text-3.1">

<p><a href="http://www.epstudiossoftware.com/">http://www.epstudiossoftware.com/</a>
</p></div>

</div>

<div id="outline-container-3.2" class="outline-3">
<h3 id="sec-3.2">3.2 Git repository </h3>
<div id="text-3.2">

<p><a href="http://github.com/mannd/epsimulator">http://github.com/mannd/epsimulator</a>
</p></div>

</div>

<div id="outline-container-3.3" class="outline-3">
<h3 id="sec-3.3">3.3 Screenshots </h3>
<div id="text-3.3">

<p><a href="https://sourceforge.net/projects/epsimulator/">https://sourceforge.net/projects/epsimulator/</a>
</p></div>

</div>

<div id="outline-container-3.4" class="outline-3">
<h3 id="sec-3.4">3.4 EP Studios Blog </h3>
<div id="text-3.4">

<p><a href="http://www.epstudiossoftware.com/blog">http://www.epstudiossoftware.com/blog</a>
</p></div>
</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4">4 Differences between EP Simulator and the GE/Prucka System </h2>
<div id="text-4">


</div>

<div id="outline-container-4.1" class="outline-3">
<h3 id="sec-4.1">4.1 Help System </h3>
<div id="text-4.1">

<p>The Prucka help system opens a PDF version of the manual.  For now,
EP Simulator Help will open this set of notes.
</p></div>

</div>

<div id="outline-container-4.2" class="outline-3">
<h3 id="sec-4.2">4.2 Simulator Settings menu </h3>
<div id="text-4.2">

</div>

</div>

<div id="outline-container-4.3" class="outline-3">
<h3 id="sec-4.3">4.3 Navigator blue sidebar </h3>
<div id="text-4.3">

<ul>
<li>
This is programmable to version 5 or version 6 appearance.
</li>
<li>
There is no "Mac-Lab" version of the sidebar.
</li>
</ul>
</div>

</div>

<div id="outline-container-4.4" class="outline-3">
<h3 id="sec-4.4">4.4 Patient Information dialog </h3>
<div id="text-4.4">

<p>Second tab is not Contact, but Physiology.  The Patient Information dialog
in EP Simulator is used to set up the patient simulation.
</p></div>

</div>

<div id="outline-container-4.5" class="outline-3">
<h3 id="sec-4.5">4.5 Administrator mode </h3>
<div id="text-4.5">

<ul>
<li>
Administrator mode is optional and can be turned off.
</li>
<li>
List, intervals, etc. can only be viewed by administrator.  In Prucka
lists can be viewed by not edited by non-administrators.
</li>
</ul>
</div>

</div>

<div id="outline-container-4.6" class="outline-3">
<h3 id="sec-4.6">4.6 Optical disk emulation </h3>
<div id="text-4.6">

<p>Study data can be stored on an actual optical disk, a hard drive
directory, or a hard drive directory disguised to mimic an optical disk.
</p></div>

</div>

<div id="outline-container-4.7" class="outline-3">
<h3 id="sec-4.7">4.7 EP List edit boxes </h3>
<div id="text-4.7">

<ul>
<li>
There are numbered rows rather than "bullets" preceding items.
</li>
<li>
Administrator mode works differently (see Administrator mode).
</li>
<li>
IMPROVEMENT: List selectors have up/down buttons to rearrange ordered lists.
</li>
</ul>
</div>

</div>

<div id="outline-container-4.8" class="outline-3">
<h3 id="sec-4.8">4.8 Look and feel </h3>
<div id="text-4.8">

<p>It is not possible (and probably not desirable) to reproduce the exact
"look and feel" of the Prucka system.  Several properties of the Prucka
system depend on non-standard handling of windows specific to MS Windows.
These properties are not easily transferred to a cross-platform system.
The look and feel will remain recognizable to Prucka users, but will not be
slavishly exact.
</p></div>

</div>

<div id="outline-container-4.9" class="outline-3">
<h3 id="sec-4.9">4.9 No ADT option in Navigator </h3>
<div id="text-4.9">

</div>
</div>
</div>
<div id="postamble"><p class="author"> Author: David Mann
<a href="mailto:mannd@epstudiossoftware.com">&lt;mannd@epstudiossoftware.com&gt;</a>
</p>
<p class="date"> Date: 2010-11-28 20:10:16 EST</p>
<p>HTML generated by org-mode 6.21b in emacs 23</p>
</div></body>
</html>
